In [41]:
import pandas as pd
import numpy as np

b1 = pd.read_csv('basic1.csv')
b1.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [42]:
b1.isnull().sum()

id       0
age      0
city     0
f1      31
f2       0
f3      95
f4       0
f5       0
dtype: int64

In [43]:
#데이터 결측 비율 구하기
b1.isnull().sum()/b1.shape[0]

id      0.00
age     0.00
city    0.00
f1      0.31
f2      0.00
f3      0.95
f4      0.00
f5      0.00
dtype: float64

In [44]:
#결측치 비율이 80%넘는 컬럼 제거
b1 = b1.drop(columns=['f3'])
b1.head()

     id   age city    f1  f2    f4         f5
0  id01   2.0   서울   NaN   0  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  INFP  52.667078
4  id05  24.0   서울  85.0   2  ISFJ  29.269869

In [45]:
b1['city'].value_counts()

경기    41
대구    20
서울    20
부산    19
Name: city, dtype: int64

In [46]:
#각 도시별 f1중앙값 구하기
k = b1[b1['city'] == '경기']['f1'].median()
d = b1[b1['city'] == '대구']['f1'].median()
s = b1[b1['city'] == '서울']['f1'].median()
b = b1[b1['city'] == '부산']['f1'].median()

b1.head()

     id   age city    f1  f2    f4         f5
0  id01   2.0   서울   NaN   0  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  INFP  52.667078
4  id05  24.0   서울  85.0   2  ISFJ  29.269869

In [47]:
#각 도시별 중앙값으로 f1결측치 대체
b1['f1'] = b1['f1'].fillna(b1['city'].map({'서울':s,'경기':k,'대구':d,'부산':b}))
b1.isnull().sum()

id      0
age     0
city    0
f1      0
f2      0
f4      0
f5      0
dtype: int64

In [48]:
print(b1['f1'].mean())

65.52